УправлениеСдачейКвартир/src/Catalogs/Договоры/Договоры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Договоры</name>
  <owners>Catalog.Клиенты</owners>
  <attributes>
    <name>Квартира</name>
    <type>
      <types>CatalogRef.Квартиры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидДоговора</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаключения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

УправлениеСдачейКвартир/src/CommonModules/ПроверкиВДокументах/Module.bsl
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьДоговор(Отказ, Договор, ДатаНачала, ДатаОкончания, Документ) Экспорт
	Если НЕ ЗначениеЗаполнено(Договор) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Договоры.ДатаНачала КАК ДатаНачала,
		|	Договоры.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Справочник.Договоры КАК Договоры
		|ГДЕ
		|	Договоры.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при получении реквизитов договора";
		Сообщение.УстановитьДанные(Документ);
		Сообщение.Поле = "Договор";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если ДатаНачала < Выборка.ДатаНачала Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Дата начала аренды не должна быть меньше даты начала действия договора";
		Сообщение.УстановитьДанные(Документ);
		Сообщение.Поле = "ДатаНачала";
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ДатаОкончания) И ДатаОкончания > Выборка.ДатаОкончания Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Дата конца аренды не должна быть больше даты конца действия договора";
		Сообщение.УстановитьДанные(Документ);
		Сообщение.Поле = "ДатаОкончания";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

Процедура ПроверкаКвартиры(Отказ, КвартираДоговор, КвартираДокумент, Документ) Экспорт
	
	Если КвартираДоговор <> КвартираДокумент Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Квартира в договоре не совпадает с квартирой в документе!";
		Сообщение.УстановитьДанные(Документ);
		Сообщение.Поле = "Квартира";
		Сообщение.Сообщить()
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
